OpenFOAM-v1812/tutorials/multiphase/interIsoFoam/discInConstantPorousFlow/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue porosity 1
);

regions
(
    boxToCell
    {
        box (1 -0.05 0) (4 0.05 3);

        fieldValues
        (
            volScalarFieldValue porosity 0.5
        );
    }
);


// ************************************************************************* //
